/*
1. Что представляет собой объект?
    Объект моделирует телефон
2. Какие данные характеризуют объект?
    String - Модель устройства
    int - Уровень заряда батареии (%)
    int - Объём памяти
    DeviceState:(Off,On) - Состояние устройства
    static int - Счётчик активных устройств (21 пункт)
3. Какие действия можно выполнять с объектом?
    turnOn - Вкл; turOff - Выкл; charge - заряжать;
    useBattery - разряжать; print - информация о текущем состоянии
4. Какие состояния объекта являются недопустимыми?
   *Уровень зарядки вне диапазона [0,100]%
   *Объём памяти <=0
   *Расход батареии при turnOff
   *Включение телефона при значении батерии 0%
*/